[{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f176c"
  },
  "name": "text-classification",
  "description": "Text Classification is the task of assigning a label or class to a given text. Some use cases are sentiment analysis, natural language inference, and assessing grammatical correctness.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f176d"
  },
  "name": "token-classification",
  "description": "Token classification is a natural language understanding task in which a label is assigned to some tokens in a text. Some popular token classification subtasks are Named Entity Recognition (NER) and Part-of-Speech (PoS) tagging. NER models could be trained to identify specific entities in a text, such as dates, individuals and places; and PoS tagging would identify, for example, which words in a text are verbs, nouns, and punctuation marks.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f176e"
  },
  "name": "table-question-answering",
  "description": "Table Question Answering (Table QA) is the answering a question about an information on a given table.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f176f"
  },
  "name": "question-answering",
  "description": "Question Answering models can retrieve the answer to a question from a given text, which is useful for searching for an answer in a document. Some question answering models can generate answers without context!",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1770"
  },
  "name": "zero-shot-classification",
  "description": "Zero-shot text classification is a task in natural language processing where a model is trained on a set of labeled examples but is then able to classify new examples from previously unseen classes.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1771"
  },
  "name": "translation",
  "description": "Translation is the task of converting text from one language to another.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1772"
  },
  "name": "summarization",
  "description": "Summarization is the task of producing a shorter version of a document while preserving its important information. Some models can extract text from the original input, while other models can generate entirely new text.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1773"
  },
  "name": "feature-extraction",
  "description": "Feature extraction is the task of extracting features learnt in a model.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1774"
  },
  "name": "text-generation",
  "description": "Generating text is the task of generating new text given another text. These models can, for example, fill in incomplete text or paraphrase.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1775"
  },
  "name": "fill-mask",
  "description": "Masked language modeling is the task of masking some of the words in a sentence and predicting which words should replace those masks. These models are useful when we want to get a statistical understanding of the language in which the model is trained in.",
  "sub-task": []
},
{
  "_id": {
    "$oid": "66c6fd44a13b1d86fa1f1776"
  },
  "name": "sentence-similarity",
  "description": "Sentence Similarity is the task of determining how similar two texts are. Sentence similarity models convert input texts into vectors (embeddings) that capture semantic information and calculate how close (similar) they are between them. This task is particularly useful for information retrieval and clustering/grouping.",
  "sub-task": []
}]